netflux/app/controllers/customers_controller.rb

  def index
    @customers = Customer.all
---
SELECT "customers".* FROM "customers"

  def show
    @customer = Customer.find(params[:id])
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]