netflux/app/controllers/movies_controller.rb

SELECT  "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def index
    @subscription = Subscription.find(params[:subscription_id])