netflux/app/controllers/movies_controller.rb

  def show
    @movie = Movie.find(params[:id])
    if @subscription.movies.include?(@movie)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "movies".* FROM "movies" INNER JOIN "xrefs" ON "movies"."id" = "xrefs"."movie_id" WHERE "xrefs"."subscription_id" = $1  [["subscription_id", 2]]
SELECT  1 AS one FROM "movies" INNER JOIN "xrefs" ON "movies"."id" = "xrefs"."movie_id" WHERE "xrefs"."subscription_id" = $1 AND "movies"."id" = $2 LIMIT $3  [["subscription_id", 3], ["id", 1], ["LIMIT", 1]]

  def get_subscription
    @subscription = Subscription.find(params[:subscription_id])
---
SELECT  "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]