netflux/app/controllers/subscriptions_controller.rb

  def index
    @subscriptions = Subscription.all
---
SELECT "subscriptions".* FROM "subscriptions"